#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tech-challenge-fiap-fastfood/tech-challenge/runs/run-KgFvLqSorTepGyvf

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
data.aws_ami.ubuntu: Refreshing...
aws_route_table_association.public: Refreshing state... [id=rtbassoc-06b4740f9b4511841]
aws_internet_gateway.gw: Refreshing state... [id=igw-09bd35b2e24b838d7]
aws_vpc.main: Refreshing state... [id=vpc-0a70b3621d13e4634]
data.aws_vpc.existing[0]: Refreshing...
aws_route_table.public: Refreshing state... [id=rtb-0ad82319bcde9ceee]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0a25f237e97fa2b5e]
data.aws_vpc.existing[0]: Refresh complete after 0s [id=vpc-0aac8157501ffc23c]
aws_subnet.main: Refreshing state... [id=subnet-086813a792bfdde6f]
aws_security_group.web-sg: Refreshing state... [id=sg-0dbc0c00511d59ac4]
aws_instance.app_server: Refreshing state... [id=i-03d2721e357c8faa5]
aws_eip.elastic_ip: Refreshing state... [id=eipalloc-06e5eb92dfcac7658]
aws_instance.app_server: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.elastic_ip will be updated in-place
  ~ resource "aws_eip" "elastic_ip" {
        id                   = "eipalloc-06e5eb92dfcac7658"
      ~ instance             = "i-03d2721e357c8faa5" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.app_server must be replaced
-/+ resource "aws_instance" "app_server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:992657255447:instance/i-03d2721e357c8faa5" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03d2721e357c8faa5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-07e8ea6c3dfd06544" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-50.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.50" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.204.211.228" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-086813a792bfdde6f" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "tech-challenge-terraform-server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0dbc0c00511d59ac4",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07113b0587421c37e" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.gw will be destroyed
  - resource "aws_internet_gateway" "gw" {
      - arn      = "arn:aws:ec2:us-east-1:992657255447:internet-gateway/igw-09bd35b2e24b838d7" -> null
      - id       = "igw-09bd35b2e24b838d7" -> null
      - owner_id = "992657255447" -> null
      - tags     = {
          - "Name" = "tech-challenge-terraform-igw"
        } -> null
      - tags_all = {
          - "Name" = "tech-challenge-terraform-igw"
        } -> null
      - vpc_id   = "vpc-0a70b3621d13e4634" -> null
    }

  # aws_route_table.public will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:992657255447:route-table/rtb-0ad82319bcde9ceee" -> null
      - id               = "rtb-0ad82319bcde9ceee" -> null
      - owner_id         = "992657255447" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-09bd35b2e24b838d7"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "tech-challenge-terraform-route-table"
        } -> null
      - tags_all         = {
          - "Name" = "tech-challenge-terraform-route-table"
        } -> null
      - vpc_id           = "vpc-0a70b3621d13e4634" -> null
    }

  # aws_route_table_association.public will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-06b4740f9b4511841" -> null
      - route_table_id = "rtb-0ad82319bcde9ceee" -> null
      - subnet_id      = "subnet-086813a792bfdde6f" -> null
    }

  # aws_security_group.web-sg must be replaced
-/+ resource "aws_security_group" "web-sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:992657255447:security-group/sg-0dbc0c00511d59ac4" -> (known after apply)
      ~ id                     = "sg-0dbc0c00511d59ac4" -> (known after apply)
      ~ name                   = "terraform-20250323001818908600000001" -> (known after apply)
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "992657255447" -> (known after apply)
        tags                   = {
            "Name" = "tech-challenge-terraform-sg"
        }
      ~ vpc_id                 = "vpc-0a70b3621d13e4634" -> "vpc-0aac8157501ffc23c" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_subnet.main must be replaced
-/+ resource "aws_subnet" "main" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:992657255447:subnet/subnet-086813a792bfdde6f" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ id                                             = "subnet-086813a792bfdde6f" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "992657255447" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "tech-challenge-terraform-subnet"
        }
      ~ vpc_id                                         = "vpc-0a70b3621d13e4634" -> "vpc-0aac8157501ffc23c" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # aws_vpc.main will be destroyed
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-east-1:992657255447:vpc/vpc-0a70b3621d13e4634" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0c6f38bfa60d4b52f" -> null
      - default_route_table_id               = "rtb-06beffa9523a93f42" -> null
      - default_security_group_id            = "sg-017aeb675f4fc95d7" -> null
      - dhcp_options_id                      = "dopt-0c88ddbbeeb9c494a" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0a70b3621d13e4634" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-06beffa9523a93f42" -> null
      - owner_id                             = "992657255447" -> null
      - tags                                 = {
          - "Name" = "tech-challenge-terraform-vpc"
        } -> null
      - tags_all                             = {
          - "Name" = "tech-challenge-terraform-vpc"
        } -> null
    }

Plan: 3 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ vpc_id      = "vpc-0a70b3621d13e4634" -> "vpc-0aac8157501ffc23c"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @bmatheusm, Action: `pull_request`*